##########################################################################################
# Unorderd - Mutable - No Duplicated allowed - Can't Indexing - Can't Slicing - Iterable #
##########################################################################################
MySet = {10,20,30}
Myset = set([10,20,30])
Myset = set((10,20,30))
#------------------------
Myset.add(40)
Myset.remove(10)    #---> لو ال 10 مش موجودة هيديك ايرور
Myset.discard(100)  #---> بدون ايرور
Myset.pop()         #---> يشيل عنصر عشوائي
Myset.clear()       #---> بيمسح كله
#-----------------------
a = {1,2,3,4}
b = {4,5,6,7}
a.union(b)                 #--->{1,2,3,4,5,6,7}
a | b
a.intersection(b)          #--->{4}
a & b
a.difference(b)            #--->{1,2,3}
a - b
a.symmetric_difference(b)  #--->{1,2,3,5,6,7}
a ^ b
